# 3. What is series ?

In [ ]:
# There are two basic object types in pandas that holds the data 
#1. Data Frame - A set of rows and coloumns.
#2. Series -   Each column is known as series. 

#This notebook will explore how we can select series

In [2]:
import pandas as pd

In [5]:
pd.read_table("http://bit.ly/uforeports").head(3)

  City,Colors Reported,Shape Reported,State,Time
0             Ithaca,,TRIANGLE,NY,6/1/1930 22:00
1          Willingboro,,OTHER,NJ,6/30/1930 20:00
2               Holyoke,,OVAL,CO,2/15/1931 14:00

In [ ]:
# Note:
# 1. We can clearly see that file is " ," seperated
# 2. What we can do is use what we learned in first tutorial i.e by using "sep = ',' " or we can also use "read_csv"

## 3.1 read_csv

In [ ]:
# Difference between read_csv and read_table 
#1.read_csv by default takes "," as seperator.

In [6]:
ufo = pd.read_csv("http://bit.ly/uforeports")
ufo.head(5)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

## 3.2 type

In [ ]:
# type is built in python method to identify type of object .

In [ ]:
# We can use type here to check if read_csv returns a data frame or not ?

In [7]:
type(ufo)

pandas.core.frame.DataFrame

In [ ]:
#we can see its a Data Frame.

## 3.3 Selecting Series

In [10]:
# Method One [] Notation

ufo['City'].head(3)

0         Ithaca
1    Willingboro
2        Holyoke
Name: City, dtype: object

In [11]:
# We can check type for the output

type(ufo['City'])

pandas.core.series.Series

In [17]:
# Dot Notation .Notation

ufo.City.head(3)

0         Ithaca
1    Willingboro
2        Holyoke
Name: City, dtype: object

In [ ]:
# Dot notation method can be used to select coloumn or series, it faster and easier.Although it comes with limitation.
# 1. .Notation can not be used to select columns where names contains space. In that Scenarion [] to be used.
# 2. .Notation also fails when any series ids named after built in function

In [ ]:
#Notes: 
# 1.Column names are case sensative, i.e using ufo['city'] instead of ufo['City'] will throw error.

## 3.4 How do i create new pandas series in Data_Frame (created by combing two coloumns into one )

In [23]:
ufo["City"] + ',' + ufo["State"]

#This will combine City and State and will also include a ',' between them.

0                      Ithaca,NY
1                 Willingboro,NJ
2                     Holyoke,CO
3                     Abilene,KS
4        New York Worlds Fair,NY
5                 Valley City,ND
6                 Crater Lake,CA
7                        Alma,MI
8                     Eklutna,AK
9                     Hubbard,OR
10                    Fontana,CA
11                   Waterloo,AL
12                     Belton,SC
13                     Keokuk,IA
14                  Ludington,MI
15                Forest Home,CA
16                Los Angeles,CA
17                  Hapeville,GA
18                     Oneida,TN
19                 Bering Sea,AK
20                   Nebraska,NE
21                           NaN
22                           NaN
23                  Owensboro,KY
24                 Wilderness,WV
25                  San Diego,CA
26                 Wilderness,WV
27                     Clovis,NM
28                 Los Alamos,NM
29               Ft. Duschene,UT
                  ...
18211                 Holyoke,MA
18212                  Carson,CA
18213                Pasadena,CA
18214                  Austin,TX
18215                El Campo,TX
18216            Garden Grove,CA
18217           Berthoud Pass,CO
18218              Sisterdale,TX
18219            Garden Grove,CA
18220             Shasta Lake,CA
18221                Franklin,NH
18222          Albrightsville,PA
18223              Greenville,SC
18224                 Eufaula,OK
18225             Simi Valley,CA
18226           San Francisco,CA
18227           San Francisco,CA
18228              Kingsville,TX
18229                 Chicago,IL
18230             Pismo Beach,CA
18231             Pismo Beach,CA
18232                    Lodi,WI
18233               Anchorage,AK
18234                Capitola,CA
18235          Fountain Hills,AZ
18236              Grant Park,IL
18237             Spirit Lake,IA
18238             Eagle River,WI
18239             Eagle River,WI
18240                    Ybor,FL
Length: 18241, dtype: object

In [ ]:
# Adding the same into our ufo data frame.

In [24]:
ufo["Location"] = ufo["City"] + ',' + ufo["State"]
ufo.head(3)

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"

In [ ]:
# We can see that now  we have a new column
#Notes :
#1. A new series is created name location and "ufo["City"] + ',' + ufo["State"]" is inserted as value.
#2. .Notation can not be used here.